## [applications/ansible-test](https://omicron7.app.spacelift.io/stack/applications-ansible-test/run/01HSE7ZP4S9B8BEWVAGQB18EVK) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HSE2J411VNRQ7285WN45TSJG] Planning changes with 0 custom hooks...
ansible_host.baz: Refreshing state... [id=baz]
ansible_host.foo: Refreshing state... [id=foo]
ansible_group.linux: Refreshing state... [id=linux]
ansible_host.bar: Refreshing state... [id=bar]
data.spacelift_current_stack.this: Reading...
data.spacelift_current_stack.this: Read complete after 0s [id=applications-ansible-test]
data.spacelift_stack.this: Reading...
data.spacelift_stack.this: Read complete after 0s [id=applications-ansible-test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # spacelift_stack.ansible will be created
  + resource "spacelift_stack" "ansible" {
      + administrative                   = false
      + autodeploy                       = false
      + autoretry                        = false
      + aws_assume_role_policy_statement = (known after apply)
      + branch                           = "main"
      + enable_local_preview             = false
      + github_action_deploy             = true
      + id                               = (known after apply)
      + manage_state                     = true
      + name                             = "applications/ansible-test Ansible"
      + project_root                     = "/"
      + protect_from_deletion            = false
      + repository                       = "spacelift-ansible"
      + slug                             = (known after apply)
      + space_id                         = (known after apply)
      + terraform_external_state_access  = false
      + terraform_smart_sanitization     = false
      + terraform_workflow_tool          = (known after apply)

      + ansible {
          + playbook = "playbook.yml"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

[01HSE2J411VNRQ7285WN45TSJG] Changes are GO
[01HSE2J411VNRQ7285WN45TSJG] Uploading the list of managed resources...
[01HSE2J411VNRQ7285WN45TSJG] Please be aware that the run changes calculation includes output changes.
[01HSE2J411VNRQ7285WN45TSJG] Resource list upload is GO
[01HSE2J411VNRQ7285WN45TSJG] Generating JSON representation of the plan...
[01HSE2J411VNRQ7285WN45TSJG] JSON representation is GO
[01HSE2J411VNRQ7285WN45TSJG] Loading custom plan policy inputs...
[01HSE2J411VNRQ7285WN45TSJG] 0 custom plan policy inputs found
[01HSE2J411VNRQ7285WN45TSJG] No plan policies to evaluate
```

</details>